
&НаКлиенте
Процедура ПолучитьСписокЧатов(Команда)
	ПолучитьСписокЧатовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокЧатовНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	СписокЧатов.Очистить();
	МенеджерВзаимодействия = Новый МенеджерСистемыВзаимодействия;
	Отбор = Новый ОтборОбсужденийСистемыВзаимодействия;
	Отбор.КонтекстноеОбсуждение = Контекст;
	Отбор.ТекущийПользовательЯвляетсяУчастником = Истина;
	Если Количество > 0 Тогда
		Отбор.Количество = Количество;
	КонецЕсли;
	Обсуждения = МенеджерВзаимодействия.ПолучитьОбсуждения(Отбор);
	Для каждого стр из Обсуждения Цикл
		строка = СписокЧатов.Добавить();
		Строка.Имя = стр.Заголовок;
		Строка.Идентификатор = стр.Идентификатор;
	КонецЦикла;	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
