
&НаКлиенте
Процедура ПолучитьСписокЧатов(Команда)
	ПолучитьСписокЧатовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокЧатовНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	СписокЧатов.Очистить();
	МенеджерВзаимодействия = Новый МенеджерСистемыВзаимодействия;
	Отбор = Новый ОтборОбсужденийСистемыВзаимодействия;
	Отбор.КонтекстноеОбсуждение = Контекст;
	Отбор.ТекущийПользовательЯвляетсяУчастником = Истина;
	Если Количество > 0 Тогда
		Отбор.Количество = Количество;
	КонецЕсли;
	Обсуждения = МенеджерВзаимодействия.ПолучитьОбсуждения(Отбор);
	Для каждого стр из Обсуждения Цикл
		строка = СписокЧатов.Добавить();
		Строка.Имя = стр.Заголовок;
		Строка.Идентификатор = стр.Идентификатор;
	КонецЦикла;	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовПриАктивизацииЯчейки(Элемент)
	Текст = "";
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда		
		СписокЧатовПриАктивизацииСтрокиНаСервере(Элемент.ТекущиеДанные.Идентификатор, Текст);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокЧатовПриАктивизацииСтрокиНаСервере(Ид, Текст)
	
	Если Элементы.СписокЧатов.ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйОтбор 	= Новый ОтборСообщенийСистемыВзаимодействия();
	ТекСтрока 	= СписокЧатов.НайтиПоИдентификатору(Элементы.СписокЧатов.ТекущаяСтрока);
	НовыйОтбор.Обсуждение = ТекСтрока.Идентификатор;
	Массив = СистемаВзаимодействия.ПолучитьСообщения(НовыйОтбор);	
	СписокСообщений.Очистить();
	
	Для каждого СообщениеПользователя Из Массив Цикл
		НоваяСтрока = СписокСообщений.Добавить();
		НоваяСтрока.Текст = СообщениеПользователя.Текст;
		НоваяСтрока.Автор = СистемаВзаимодействия.ПолучитьПользователя(СообщениеПользователя.Автор).Имя; 			
	КонецЦикла;
	
КонецПроцедуры
