Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

	ИмяПользователя = ИмяПользователя();

	Если ПустаяСтрока(ИмяПользователя) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыСеанса.РазделительИспользование = Истина;
	ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);

	Если ТекущийПользователь.Пустая() Тогда
		НовПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовПользователь.ТекущийПользователь = ПолноеИмяПользователя();
		НовПользователь.Наименование = ИмяПользователя();
		НовПользователь.Записать();
		ТекущийПользователь = НовПользователь.Ссылка;
	КонецЕсли;

	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;

КонецПроцедуры
