
Процедура ОбработкаСообщенияСистемыВзаимодействия(Сообщение, ДополнительныеПараметры)
	
	Ответ = СистемаВзаимодействия.СоздатьСообщение(Сообщение.Обсуждение);
	НовыйОтбор 	= Новый ОтборСообщенийСистемыВзаимодействия();
	НовыйОтбор.Обсуждение = Сообщение.Обсуждение;
	Сообщения = СистемаВзаимодействия.ПолучитьСообщения(НовыйОтбор);
	Если Сообщения.Количество()=1 Тогда
		Ответ.Текст = "Привет! Я помогу тебе получить телефон контрагента. Введи его имя.";		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Контрагенты.Телефон КАК Телефон,
		|	Контрагенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО ""%"" + &Наименование + ""%""
		|	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
		Запрос.УстановитьПараметр("Наименование",Строка(Сообщение.Текст));
		ЗВ = Запрос.Выполнить();
		Если ЗВ.Пустой() Тогда		
			Ответ.Текст = "Я не смог найти такого контрагента, попробуй ещё раз.";
		Иначе
			таб = ЗВ.Выгрузить();
			Если Таб.Количество()=1 Тогда
				Ответ.Текст = "Контрагент: " + Таб[0].Наименование + ". Телефон: " + Таб[0].Телефон;
			Иначе
				текстОтвета = "Я нашел несколько контрагентов, вот их данные:" + Символы.ПС;
				Для каждого стр из Таб Цикл
					текстОтвета = текстОтвета + "Контрагент: " + стр.Наименование + ". Телефон: " + стр.Телефон + Символы.ПС;
				КонецЦикла;	
				Ответ.Текст = текстОтвета;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Ответ.Записать();
	
КонецПроцедуры
