
&НаСервере
Процедура ПолучитьПользователейСистемыВзаимодействияНаСервере()
	СписокПользователей.Очистить();
	Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Пользователи = СистемаВзаимодействия.ПолучитьПользователей();//Пользователи[0].НомерТелефона		
		Для каждого стр из Пользователи Цикл
			строка = СписокПользователей.Добавить();
			строка.ИмяПользователя = стр.Имя;
			строка.АдресЭлектроннойПочты = стр.АдресЭлектроннойПочты;
			строка.НомерТелефона = стр.НомерТелефона;
			строка.ИдентификаторПользователя = стр.Идентификатор;
		КонецЦикла;	
	Иначе	
		Сообщить("Информационная база не зарегистрирована в системе взаимодействия!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПользователейСистемыВзаимодействия(Команда)
	ПолучитьПользователейСистемыВзаимодействияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаПользователейСВ_ИзБазыНаСервере()
	Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для каждого стр из СписокПользователей Цикл
			ПользовательИБ_ = Справочники.Пользователи.НайтиПоНаименованию(стр.ИмяПользователя);
			Если НЕ ПользовательИБ_.Пустая() и (ЗначениеЗаполнено(ПользовательИБ_.АдресЭлектроннойПочты) или ЗначениеЗаполнено(ПользовательИБ_.НомерТелефона)) Тогда
				ПользовательСВ = СистемаВзаимодействия.ПолучитьПользователя(стр.ИдентификаторПользователя);
				ПользовательСВ.АдресЭлектроннойПочты = ПользовательИБ_.Ссылка.АдресЭлектроннойПочты;
				ПользовательСВ.НомерТелефона = ПользовательИБ_.Ссылка.НомерТелефона;
				Попытка
					ПользовательСВ.Записать();
				Исключение Сообщить("Ошибка записи пользователя " + стр.ИмяПользователя + ". Возможно в адресе электронной почты имеются русские буквы. Ошибка " + ОписаниеОшибки());
				КонецПопытки;
			Иначе
				Сообщить("Пользователь " + стр.ИмяПользователя + " не найден в иб.");
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе	
		Сообщить("Информационная база не зарегистрирована в системе взаимодействия!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресаПользователейСВ_ИзБазы(Команда)
	ЗаполнитьАдресаПользователейСВ_ИзБазыНаСервере();
	ПолучитьПользователейСистемыВзаимодействияНаСервере();
КонецПроцедуры
